𝑐𝑜𝑛𝑠𝑡 𝑒𝑥𝑝𝑟𝑒𝑠𝑠 = 𝑟𝑒𝑞𝑢𝑖𝑟𝑒('𝑒𝑥𝑝𝑟𝑒𝑠𝑠');
𝑐𝑜𝑛𝑠𝑡 𝑐𝑜𝑟𝑠 = 𝑟𝑒𝑞𝑢𝑖𝑟𝑒('𝑐𝑜𝑟𝑠');
𝑐𝑜𝑛𝑠𝑡 𝑛𝑜𝑑𝑒𝑚𝑎𝑖𝑙𝑒𝑟 = 𝑟𝑒𝑞𝑢𝑖𝑟𝑒('𝑛𝑜𝑑𝑒𝑚𝑎𝑖𝑙𝑒𝑟');
𝑟𝑒𝑞𝑢𝑖𝑟𝑒('𝑑𝑜𝑡𝑒𝑛𝑣').𝑐𝑜𝑛𝑓𝑖𝑔();

𝑐𝑜𝑛𝑠𝑡 𝑎𝑝𝑝 = 𝑒𝑥𝑝𝑟𝑒𝑠𝑠();
𝑎𝑝𝑝.𝑢𝑠𝑒(𝑐𝑜𝑟𝑠({ 𝑜𝑟𝑖𝑔𝑖𝑛: "*" }));
𝑎𝑝𝑝.𝑢𝑠𝑒(𝑒𝑥𝑝𝑟𝑒𝑠𝑠.𝑗𝑠𝑜𝑛({ 𝑙𝑖𝑚𝑖𝑡: "10𝑚𝑏" }));

𝑙𝑒𝑡 𝑝𝑜𝑠𝑡𝑠 = [{ 𝑢𝑠𝑒𝑟: "𝑊𝑢𝑛𝑧𝑜𝑜𝑦𝑎 𝑀𝑏𝑎", 𝑧𝑜𝑛𝑒: "𝑡𝑎𝑚𝑎𝑙𝑒", 𝑡𝑒𝑥𝑡: "ℎ𝑒𝑙𝑙𝑜 𝑤𝑜𝑟𝑙𝑑" }];
𝑙𝑒𝑡 𝑢𝑠𝑒𝑟𝑠 = [];
𝑙𝑒𝑡 𝑐𝑜𝑑𝑒𝑠 = {};

𝑓𝑢𝑛𝑐𝑡𝑖𝑜𝑛 𝑔𝑒𝑡𝐶𝑜𝑑𝑒() {
  𝑟𝑒𝑡𝑢𝑟𝑛 𝑀𝑎𝑡ℎ.𝑓𝑙𝑜𝑜𝑟(100000 + 𝑀𝑎𝑡ℎ.𝑟𝑎𝑛𝑑𝑜𝑚() * 900000).𝑡𝑜𝑆𝑡𝑟𝑖𝑛𝑔();
}

𝑐𝑜𝑛𝑠𝑡 𝑡𝑟𝑎𝑛𝑠𝑝𝑜𝑟𝑡𝑒𝑟 = 𝑛𝑜𝑑𝑒𝑚𝑎𝑖𝑙𝑒𝑟.𝑐𝑟𝑒𝑎𝑡𝑒𝑇𝑟𝑎𝑛𝑠𝑝𝑜𝑟𝑡({
  𝑠𝑒𝑟𝑣𝑖𝑐𝑒: '𝑔𝑚𝑎𝑖𝑙',
  𝑎𝑢𝑡ℎ: {
    𝑢𝑠𝑒𝑟: 𝑝𝑟𝑜𝑐𝑒𝑠𝑠.𝑒𝑛𝑣.𝐸𝑀𝐴𝐼𝐿_𝑈𝑆𝐸𝑅,
    𝑝𝑎𝑠𝑠: 𝑝𝑟𝑜𝑐𝑒𝑠𝑠.𝑒𝑛𝑣.𝐸𝑀𝐴𝐼𝐿_𝑃𝐴𝑆𝑆
  }
});

𝑎𝑝𝑝.𝑔𝑒𝑡("/", (𝑟𝑒𝑞, 𝑟𝑒𝑠) => {
  𝑟𝑒𝑠.𝑠𝑒𝑛𝑑("𝐵𝑀2 𝐴𝑃𝑃 𝑖𝑠 𝐿𝑖𝑣𝑒");
});

𝑎𝑝𝑝.𝑝𝑜𝑠𝑡("/𝑎𝑝𝑖/𝑎𝑢𝑡ℎ/𝑟𝑒𝑔𝑖𝑠𝑡𝑒𝑟", 𝑎𝑠𝑦𝑛𝑐 (𝑟𝑒𝑞, 𝑟𝑒𝑠) => {
  𝑐𝑜𝑛𝑠𝑡 { 𝑒𝑚𝑎𝑖𝑙, 𝑐𝑜𝑛𝑡𝑎𝑐𝑡, 𝑛𝑎𝑚𝑒, 𝑎𝑔𝑒, 𝑐𝑜𝑢𝑛𝑡𝑟𝑦, 𝑠𝑒𝑥 } = 𝑟𝑒𝑞.𝑏𝑜𝑑𝑦;
  𝑐𝑜𝑛𝑠𝑡 𝑘𝑒𝑦 = 𝑒𝑚𝑎𝑖𝑙 || 𝑐𝑜𝑛𝑡𝑎𝑐𝑡;
  𝑐𝑜𝑛𝑠𝑡 𝑐𝑜𝑑𝑒 = 𝑔𝑒𝑡𝐶𝑜𝑑𝑒();
  𝑐𝑜𝑑𝑒𝑠[𝑘𝑒𝑦] = { 𝑐𝑜𝑑𝑒, 𝑒𝑥𝑝𝑖𝑟𝑒𝑠: 𝐷𝑎𝑡𝑒.𝑛𝑜𝑤() + 600000, 𝑢𝑠𝑒𝑟𝐷𝑎𝑡𝑎: { 𝑒𝑚𝑎𝑖𝑙, 𝑐𝑜𝑛𝑡𝑎𝑐𝑡, 𝑛𝑎𝑚𝑒, 𝑎𝑔𝑒, 𝑐𝑜𝑢𝑛𝑡𝑟𝑦, 𝑠𝑒𝑥 } };
  𝑐𝑜𝑛𝑠𝑜𝑙𝑒.𝑙𝑜𝑔(`𝐶𝑂𝐷𝐸 𝑓𝑜𝑟 ${𝑘𝑒𝑦}: ${𝑐𝑜𝑑𝑒}`);
  𝑟𝑒𝑠.𝑗𝑠𝑜𝑛({ 𝑠𝑢𝑐𝑐𝑒𝑠𝑠: 𝑡𝑟𝑢𝑒, 𝑚𝑒𝑠𝑠𝑎𝑔𝑒: "𝐶𝑜𝑑𝑒 𝑠𝑒𝑛𝑡", 𝑐𝑜𝑑𝑒 });
});

𝑎𝑝𝑝.𝑝𝑜𝑠𝑡("/𝑎𝑝𝑖/𝑎𝑢𝑡ℎ/𝑣𝑒𝑟𝑖𝑓𝑦", (𝑟𝑒𝑞, 𝑟𝑒𝑠) => {
  𝑐𝑜𝑛𝑠𝑡 { 𝑒𝑚𝑎𝑖𝑙, 𝑐𝑜𝑛𝑡𝑎𝑐𝑡, 𝑐𝑜𝑑𝑒 } = 𝑟𝑒𝑞.𝑏𝑜𝑑𝑦;
  𝑐𝑜𝑛𝑠𝑡 𝑘𝑒𝑦 = 𝑒𝑚𝑎𝑖𝑙 || 𝑐𝑜𝑛𝑡𝑎𝑐𝑡;
  𝑐𝑜𝑛𝑠𝑡 𝑠𝑎𝑣𝑒𝑑 = 𝑐𝑜𝑑𝑒𝑠[𝑘𝑒𝑦];
  𝑖𝑓 (!𝑠𝑎𝑣𝑒𝑑 || 𝑠𝑎𝑣𝑒𝑑.𝑐𝑜𝑑𝑒!== 𝑐𝑜𝑑𝑒) 𝑟𝑒𝑡𝑢𝑟𝑛 𝑟𝑒𝑠.𝑠𝑡𝑎𝑡𝑢𝑠(400).𝑗𝑠𝑜𝑛({ 𝑒𝑟𝑟𝑜𝑟: "𝐼𝑛𝑣𝑎𝑙𝑖𝑑 𝑐𝑜𝑑𝑒" });
  𝑢𝑠𝑒𝑟𝑠.𝑝𝑢𝑠ℎ(𝑠𝑎𝑣𝑒𝑑.𝑢𝑠𝑒𝑟𝐷𝑎𝑡𝑎);
  𝑑𝑒𝑙𝑒𝑡𝑒 𝑐𝑜𝑑𝑒𝑠[𝑘𝑒𝑦];
  𝑟𝑒𝑠.𝑗𝑠𝑜𝑛({ 𝑠𝑢𝑐𝑐𝑒𝑠𝑠: 𝑡𝑟𝑢𝑒, 𝑢𝑠𝑒𝑟: 𝑠𝑎𝑣𝑒𝑑.𝑢𝑠𝑒𝑟𝐷𝑎𝑡𝑎 });
});

𝑎𝑝𝑝.𝑔𝑒𝑡("/𝑎𝑝𝑖/𝑝𝑜𝑠𝑡𝑠", (𝑟𝑒𝑞, 𝑟𝑒𝑠) => 𝑟𝑒𝑠.𝑗𝑠𝑜𝑛(𝑝𝑜𝑠𝑡𝑠));
𝑎𝑝𝑝.𝑝𝑜𝑠𝑡("/𝑎𝑝𝑖/𝑝𝑜𝑠𝑡𝑠", (𝑟𝑒𝑞, 𝑟𝑒𝑠) => {
  𝑝𝑜𝑠𝑡𝑠.𝑝𝑢𝑠ℎ(𝑟𝑒𝑞.𝑏𝑜𝑑𝑦);
  𝑟𝑒𝑠.𝑗𝑠𝑜𝑛({ 𝑠𝑢𝑐𝑐𝑒𝑠𝑠: 𝑡𝑟𝑢𝑒 });
});

𝑐𝑜𝑛𝑠𝑡 𝑃𝑂𝑅𝑇 = 𝑝𝑟𝑜𝑐𝑒𝑠𝑠.𝑒𝑛𝑣.𝑃𝑂𝑅𝑇 || 10000;
𝑎𝑝𝑝.𝑙𝑖𝑠𝑡𝑒𝑛(𝑃𝑂𝑅𝑇, () => {
  𝑐𝑜𝑛𝑠𝑜𝑙𝑒.𝑙𝑜𝑔(`𝐵𝑀2 𝐴𝑃𝑃 𝑟𝑢𝑛𝑛𝑖𝑛𝑔 𝑜𝑛 𝑝𝑜𝑟𝑡 ${𝑃𝑂𝑅𝑇}`);
});

𝑚𝑜𝑑𝑢𝑙𝑒.𝑒𝑥𝑝𝑜𝑟𝑡𝑠 = 𝑎𝑝𝑝;